import random
import math
def log(num1,num2):
    return math.log(num2,num1)

a0=int(input('请输入5星球员概率(%):'))
a0=0.01*a0
a=int(input('请输入5星球员数量:'))
b=int(input('请输入高光/黄传/精选球员数量:'))
c=int(input('请输入金币抽取次数:'))
d=int(input('请输入券抽取次数:'))
p0=((1-(a0*(b/a)))**c)*(0.9**d)
p1=((1-(a0*(b/a)))**(c-1)*(c*a0*(b/a)))*(0.9**d)+((1-(a0*(b/a)))**c)*(0.9**(d-1)*0.1*d)
p2=[
    ((1-(a0*(b/a)))**(c-2)*(c*(c-1)/2)*(a0*(b/a))**2)*(0.9**d) + 
    #  金币没出               排列      金币出       券没出                       ##金币出
    ((1-(a0*(b/a)))**c)*(0.9**(d-2)*(d*(d-1)/2)*0.01) + 
    #   金币没出          券出的            排列                                     ##券出
    ((1-(a0*(b/a)))**(c-1)*(c*a0*(b/a)))*((1-(a0*(b/a)))**c)*(0.9**(d-1)*0.1*d)
    #             金币出一个                       券出一个                          ##各出一个
]
print('不出的概率:',p0)
print('出一个的概率:',p1)
print('出二个的概率:',p2[0])
print('出二个以上的概率:',1-p0-p1-p2[0])
